{
  "architectures": [
    "InstructBlipForConditionalGeneration"
  ],
  "image_token_index": 32001,
  "initializer_factor": 1.0,
  "initializer_range": 0.02,
  "model_type": "instructblip",
  "num_query_tokens": 32,
  "qformer_config": {
    "attention_probs_dropout_prob": 0.1,
    "cross_attention_frequency": 2,
    "encoder_hidden_size": 1408,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 512,
    "model_type": "instructblip_qformer",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "pad_token_id": 0,
    "position_embedding_type": "absolute",
    "vocab_size": 32001
  },
  "text_config": {
    "_name_or_path": "lmsys/vicuna-7b-delta-v1.1",
    "architectures": [
      "LLaMAForCausalLM"
    ],
    "attention_bias": false,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 11008,
    "max_sequence_length": 2048,
    "mlp_bias": false,
    "model_type": "llama",
    "num_attention_heads": 32,
    "num_hidden_layers": 32,
    "num_key_value_heads": 32,
    "pad_token_id": 0,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-06,
    "rope_scaling": null,
    "rope_theta": 10000.0,
    "tie_word_embeddings": false,
    "torch_dtype": "float16",
    "transformers_version": "4.31.0",
    "use_cache": true,
    "vocab_size": 32001
  },
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.31.0",
  "use_decoder_only_language_model": true,
  "video_token_index": 32002,
  "vision_config": {
    "dropout": 0.0,
    "attention_dropout": 0.0,
    "hidden_act": "gelu",
    "hidden_size": 1408,
    "image_size": 224,
    "initializer_range": 1e-10,
    "initializer_factor": 1.0,
    "intermediate_size": 6144,
    "layer_norm_eps": 1e-06,
    "model_type": "instructblip_vision_model",
    "num_attention_heads": 16,
    "num_hidden_layers": 39,
    "patch_size": 14,
    "projection_dim": 512,
    "qkv_bias": true,
    "vocab_size": 32000
  },
  "vocab_size": 32001
}